<html>
	<head>
		<title>Design</title>
		<meta charset="utf-8">
		<link rel="stylesheet" href="Public/Layouts/css/main.css">
	</head>
	<body>
		
			<?php
				include('Public/Layouts/base.php');
				header1();
				nav();
			?>
			<div id="content">
				<img src="Public/Layouts/images/about.jpg" alt="about" width="300" />
				<h1 class="wrapper">Google</h1>
				<p>KaZaA и Церковь саентологии использовали Закон об авторском праве в цифровую эпоху (DMCA), чтобы потребовать от Google удалить ссылки на материалы на их сайтах, якобы защищённые авторским правом.[15][16] Google по закону обязан удалить эти ссылки, но вместо того, чтобы убрать результаты поиска, предпочитает связать результаты с жалобами, которые подали эти организации[16].

					The New York Times жаловалась на то, что кэширование их содержания поисковым роботом — особенность, используемая поисковиками, в том числе Google Web Search, нарушает авторские права.[17] Google соблюдает стандартные Интернет-приёмы для запросов об отключении кэширования посредством файла robots.txt — стандартного механизма, позволяющего администраторам веб-сайта потребовать исключения своего сайта или его части из результатов поиска — или через мета-теги, позволяющие редактору контента указать, можно ли индексировать или архивировать документ и можно ли проходить по ссылкам в документе. Окружной суд США штата Невада постановил, что кэши компании Google не нарушают авторских прав согласно американскому законодательству в делах Field v. Google и Parker v. Google[18][19].

					В 2013 году Google, наряду с другими известными IT-компаниями (Microsoft, Facebook, Yahoo) была обвинена бывшим сотрудником АНБ США Э.Сноуденом в том, что они являются инструментом американских спецслужб в неконституционной глобальной слежке за пользователями интернет. Google собирала, сохраняла и предоставляла открытый доступ для американских спецслужб все сведения о пользователе, которые способна получить при взаимодействии с ним. Для вознаграждения за эту деятельность из бюджета АНБ были выделены значительные суммы. 23 августа АНБ признало факты сознательного превышения полномочий при отслеживании коммуникаций. Разведывательное агентство призналось в нарушении распоряжения, которое было подписано в 1981 году Рональдом Рейганом. [20].</p>
			</div>
			<?php
				
				sidebar();
				footer();
			?>
		
	</body>
</html>